
# Пост приветствие от бота
greeting_post = (f"👋<b>Привет!</b>\n\n"
                 f"<i>Я 🤖 бот для parsing постов с групп и каналов в вашу группу.\n\n"
                 f"Я могу помочь вам автоматически собирать посты с различных 💬 групп и каналов и публиковать их в "
                 f"вашей группе.\n\n"
                 f"Для начала мне понадобятся некоторые ⚙️ настройки. Пожалуйста, предоставьте мне 📋 список групп и "
                 f"каналов, из которых вы хотели бы получать посты, а также указания по "
                 f"формату и 🗓 расписанию публикации.\n\n"
                 f"Давайте начнем!</i>\n\n")
